"""
Задание 4. Кино
Что нужно сделать
Илья зашёл на любительский киносайт, на котором пользователи оставляют рецензии на фильмы.
Их список:
films = [‘Крепкий орешек’, ‘Назад в будущее’, ‘Таксист’, ‘Леон’, ‘Богемская рапсодия’, ‘Город грехов’, ‘Мементо’, ‘Отступники’, ‘Деревня’]
Илья на сайте в первый раз. Он хочет зарегистрироваться и сразу добавить часть фильмов
в список любимых, чтобы позже прочитать рецензии на них.
Напишите программу, в которой пользователь вводит фильм.
Если кинокартина есть в перечне, то добавляется в список любимых.
Если её нет, то выводится ошибка. В конце выведите весь список любимых фильмов.

Пример:
> Сколько фильмов хотите добавить? 3
> Введите название фильма: Леон
> Введите название фильма: Безумный Макс
> Ошибка: фильма Безумный Макс у нас нет :(
> Введите название фильма: Мементо
> Ваш список любимых фильмов: Леон, Мементо
"""

films_amount = int(input('How many films would you like to add: '))
films = ['Крепкий орешек', 'Назад в будущее', 'Таксист', 'Леон', 'Богемская рапсодия', 'Город грехов',
         'Мементо', 'Отступники', 'Деревня']

favorite_films = list()

for i in range(films_amount):
    name = input('Enter a name of film: ')
    if name in films:
        favorite_films.append(name)
    else:
        print(f'Error. We don\'t have {name} film')


print(f"List of your favorite films: {', '.join(favorite_films)}")




