"""
Задание 5. Контейнеры
Что нужно сделать
Контейнеры на складе лежат в ряд в порядке невозрастания (меньше либо равно) массы в килограммах.
На склад привезли ещё один контейнер, который тоже нужно положить на определённое место.
Напишите программу, которая получает на вход невозрастающую последовательность натуральных чисел.
Они означают массу каждого контейнера в ряду.
После этого вводится число X — масса нового контейнера.
Программа выводит номер, под которым будет лежать новый контейнер.
Если в ряду есть контейнеры с массой, как у нового, то его нужно положить после них.

Обеспечьте контроль ввода: все числа не превышают 200.

Пример:

> Количество контейнеров: 8
> Введите вес контейнера: 165
> Введите вес контейнера: 163
> Введите вес контейнера: 160
> Введите вес контейнера: 160
> Введите вес контейнера: 157
> Введите вес контейнера: 157
> Введите вес контейнера: 155
> Введите вес контейнера: 154
> Введите вес нового контейнера: 162
> Номер, который получит новый контейнер: 3
"""

cont_amount = int(input('Amount of containers: '))
containers = list()
counter = 0

while counter != cont_amount:
    weight = int(input(f'Weight of {counter + 1} container: '))
    if weight > 200:
        print('Weight must be below 200')
        continue
    else:
        containers.append(weight)
        counter += 1


print(containers)
new_container = int(input('Weight of new container: '))
position = 0

# Reversed cycle
for i in range(len(containers) - 1, 0 - 1, -1):
    if new_container <= containers[i]:
        position = i + 2
        break

print(f'Position number for new container {position}')

