"""
Задание 9. Обратный анализ чётных чисел
Вы работаете в научной лаборатории, в ней проводятся эксперименты и записываются результаты
в виде списка целых чисел. Ваша задача — написать программу, которая поможет исследователям выделить
чётные числа из списка результатов экспериментов.
Они хотят анализировать эти числа в обратном порядке, чтобы исследовать особые закономерности,
связанные с чётными значениями.
Задача
Напишите программу, которая считывает целые числа из списка и выводит из него только чётные
в обратном порядке. Создавать дополнительные списки нельзя.

Что нужно сделать
Напишите программу, которая принимает список целых чисел, извлекает из него только чётные числа
и выводит их в обратном порядке. При этом не используйте дополнительные списки
и не применяйте сортировку.

Ограничения
Нельзя использовать:
- метод reverse,
- функцию reversed,
- разворот при помощи среза (список[::-1]).
Советы
Вы можете управлять направлением перебора элементов в списке (можете перебирать элементы с начала до конца, а можете начать с конца и двигаться к началу). Это может стать основой решения задачи.
Список является изменяемым типом данных, значит вы можете изменять положение элементов внутри списка. Это может стать основой ещё одного варианта решения задачи. Можете выбрать любой или решить обоими способами!
Обратите внимание: некоторые операции со списками создают их копии, даже если вы не указываете на это явно. Простой пример, который это демонстрирует:
test = [1, 2, 3]
print(id(test)) # Здесь вы увидите один айди
test = test[::-1]
print(id(test)) # А здесь уже другой

"""


# def get_even_num(numbers: list) -> list:
#     for i in range(len(numbers) - 1, 0 - 1, -1):
#         if numbers[i] % 2 == 0:
#             numbers[len(numbers) - i - 1] = numbers[i]
#         else:
#             numbers.remove(numbers[i])

# 1 2 3 4 5 6 7 8
# 6 4 3 8 1

# size = int(input('Enter size of your list: '))
#
# numbers = [int(input('Enter a number: ')) for num in range(size)]
# print('List of even numbers:', end=' ')
# for i in range(len(numbers) - 1, 0 - 1, -1):
#     if numbers[i] % 2 == 0:
#         print(numbers[i], end=' ')


def get_numbers():
    a = int(input('Enter a number: '))
    if a == 0:
        print('Reversed list: ', end='')
        return
    else:
        get_numbers()
    if a % 2 == 0:
        print(a, end=' ')


get_numbers()

