print('Task 1. Space')

# Ваш космический корабль потерпел крушение на пустынной планете.
# Еда здесь не растёт, но вы спасли из обломков 100-килограммовый мешок гречки.
# Из прошлого опыта вы знаете, что если будете экономно питаться, то у вас будет
# уходить по четыре килограмма гречки в месяц.

# Чтобы прикинуть гречневый бюджет, вы решили написать программу, которая выведет информацию о том
# сколько килограммов гречки у вас должно быть в запасе через месяц,
# два и так далее, пока она не закончится. Используйте цикл for.

grechka_total = 100
month = 0
for pounds in range(grechka_total, 0-1, -4):
    month +=1
    print(f'Осталось {pounds} кг гречки в начале {month} месяца\n')



