"""
Задание 2. Самое длинное слово
Что нужно сделать
Пользователь вводит строку, содержащую пробелы.
Найдите в ней самое длинное слово, выведите его и его длину.
Если таких слов несколько, выведите первое.

Пример 1
> Введите строку: я есть строка.
> Самое длинное слово: «строка».
> Длина этого слова: 6 символов.

Пример 2
> Введите строку: а б.
> Самое длинное слово: «а».
> Длина этого слова: 1 символ.

Пример 3
> Введите строку: б.
> Самое длинное слово: «б».
> Длина этого слова: 1 символ.
"""

message = input('Your message: ').split()
longest_word = ''
max_length = 0
for word in message:
    if len(word) > max_length:
        longest_word = word
        max_length = len(word)

print(f'The longest word: {longest_word}')
print(f'Length of this word: {max_length}')
