print('Task 4. Area of triangle')

# Напишите программу,
# которая запрашивает у пользователя длины двух катетов
# в прямоугольном треугольнике и выводит его площадь.

# Формула:
# S = ab/2

leg_1 = float(input('Enter the first leg:'))
leg_2 = float(input('Enter the second leg:'))
print(f'Triangle area: {(leg_1 * leg_2) / 2}')

