"""
Задача 3. Свой словарь
В силу обстоятельств Васе постоянно приходится работать со словарями и их данными.
В том числе и с методом get, который по умолчанию возвращает None,
если такого ключа в словаре нет.
Однако Васю это не устраивает: для нормальной работы ему нужно возвращать число 0.
Реализуйте класс MyDict, который будет вести себя точно так же, как и обычный словарь
(попробуйте унаследовать его от оригинального dict),
за исключением того, что метод get по умолчанию будет возвращать не None, а число 0.
"""


class MyDict(dict):

    def get(self, key, default=0):
        return super().get(key, default)


my_dict = MyDict()
my_dict['twelve'] = 12
my_dict['eight'] = 8
print(type(my_dict))
print(my_dict.get('eight'))
print(my_dict.get('five'))
