print('Task 8. Game 2')

# Поменяйте мальчика и компьютер из прошлой задачи местами.
# Теперь мальчик загадывает число между 1 и 100 (включительно).
# Компьютер может спросить у мальчика:
# «Твое число равно, меньше или больше, чем число N?»,
# где N — число, которое хочет проверить компьютер.
# Мальчик отвечает одним из трёх чисел:
# 1 — равно,
# 2 — больше,
# 3 — меньше.

# Напишите программу,
# которая с помощью цепочки таких вопросов и ответов мальчика угадывает число.

# Дополнительно: сделайте так, чтобы можно было гарантированно угадать число за семь попыток.

# Подсказка: При желании найдите описание алгоритма бинарного поиска и попробуйте применить в этой задаче.
# Разбор подобного решения будет в следующем модуле.

N = 50
shift = 50

while True:
    flag = int(input(f'Your number equal (1), more (2) or less (3), than {N}?'))
    if flag == 1:
        break
    # shift = shift / 2 if (shift % 2 == 0) else (shift + 1) / 2
    # N += shift if flag == 2 else -shift
    if shift % 2 != 0:
        shift += 1
    shift /= 2
    if flag == 2:
        N += shift
    else:
        N -= shift
print(f'I guessed your number {N}')
