print('Задача 2. Коллекторы')

# Напишите робота для коллекторов.
# В самом начале он спрашивает имя должника и сумму долга,
# а затем начинает требовать у него погашения до тех пор,
# пока он не введёт нужную сумму (равную сумме долга или больше).
# После погашения долга сообщите об этом пользователю и поблагодарите его.

# Пример:
# Василий, ваша задолженность составляет 100 рублей.
# Сколько рублей вы внесёте прямо сейчас, чтобы её погасить? 50

# Маловато, Василий. Давайте ещё раз.
# Сколько рублей вы внесёте прямо сейчас, чтобы её погасить? 90
# Маловато, Василий. Давайте ещё раз.

# Сколько рублей вы внесёте прямо сейчас, чтобы её погасить? 110
# Отлично, Василий! Вы погасили долг. Спасибо!

name = input('Ваше имя: ')
credit = int(input('Введите сумму вашего долга: '))
money_for_credit= 0
print(f'{name}, ваша задолженность составляет {credit} рублей')

while True:
    money_for_credit = int(input('Сколько рублей вы внесёте прямо сейчас, чтобы её погасить? '))
    if money_for_credit >= credit:
        break
    print(f'Маловато, {name}. Давайте ещё раз.')

print(f'Отлично, {name}! Вы погасили долг. Спасибо!')


