# Задача 1. Урок литературы
#
# К уроку литературы нужно было прочитать “Евгения Онегина”. Учитель задаёт вопрос пяти случайным детям
# Она задаёт вопрос “Кто написал произведение?” и если ученик не угадывает, то учитель ставит двойку
# и спрашивает следующего. Если хоть кто-то угадает, то вопросы больше не задаются.
# Напишите программу, которая посчитает количество двоечников из этих пяти.

# bad_grade = 0
#
# for student in range(5):
#     answer = input('Кто написал Евгения Онегина? ')
#     if answer == 'Пушкин' or answer == 'пушкин':
#         print('Правильно!')
#         break
#     print('Не угадал! Два!')
#     bad_grade += 1
# print(f'Количество двоек {bad_grade}')


# Задача 2. Начальник
# Напишите программу для робота-начальника. Он спрашивает у пользователя,
# # выполнил ли он задание, которое выдавал вчера, и продолжает это делать до тех пор,
# пока тот не ответит ему “Да, конечно, сделал”.

# answer = 'Да, конечно, сделал'
# user_answer =''
# while user_answer != answer:
#     user_answer = input('Ты выполнил вчерашнее задание? ')
# print('Хорошо')


# Задача 3. Дразнилка
# Напишите программу-дразнилку “Купи слона”. Она спрашивает у пользователя,
# как его зовут, затем отвечает “%username%, купи слона”.
# Дальше, что бы он ни говорил, она передразнивает: Все говорят “...”, а ты купи слона!
#
# Пример:
# # Как тебя зовут? Дима
# # Дима, купи слона!
# # Хорошо, давай куплю
# # Все говорят Хорошо, давай куплю, а ты купи слона!

# username = input('Как тебя зовут? ')
# print(f'{username}, купи слона')
#
# while True:
#     answer = input('user answer: ')
#     print(f'Все говорят {answer}, а ты купи слона!')

# Задача 1. Python!
# Напишите программу, которая выводит в отдельную строчку каждый символ фразы “Python!”.

# for sym in 'Python!':
#     print(sym)


# Задача 2. Вирус
# Ваня экспериментирует с различного рода компьютерными вирусами,
# которые портят жизнь людям. На просторах Интернета он нашёл код довольно необычного вируса,
# который “поворачивает” весь текст в документе и повторяет каждый символ 3 раза.
#
# Пользователь вводит текст. Напишите программу,
# которая выводит каждый символ текста в отдельной строке и три раза.
#
# Пример:
# # Введите текст: Привет!
# # ППП
# # ррр
# # иии
# # ввв
# # еее
# # ттт
# # !!!

# text = input('Введите текст: ')
#
# for symbol in text:
#     print(symbol * 3)

# Задача 3.
# Мы входим в команду разработки нового текстового редактора
# и нам поручили разработать для него подсчёт нужного символа в тексте, а именно - буквы Ы.
# Причём отдельно с верхним регистром и отдельно с нижним.
#
# Напишите программу, которая считает количество больших и количество маленьких букв Ы в
# тексте и выводит ответ на экран.
#
# Пример:
# # Введите текст: Прыг скок
# # Больших букв Ы: 0
# # Маленьких букв Ы: 1

# text = input('Введите текст: ')
# upper_letter = "Ы"
# lower_letter = "ы"
# upper_count = 0
# lower_count = 0
#
# for symbol in text:
#     if symbol == upper_letter:
#         upper_count += 1
#     if symbol == lower_letter:
#         lower_count += 1
#
# print(f'Кол-во больших букв Ы: {upper_count} \n'
#       f'Кол-во маленьких букв ы: {lower_count}')

#Задача
# height = int(input('Высота: '))
# width = int(input('Ширина: '))
#
# print('-' * (width + 4))
# for _ in range(height):
#     # print('|', '0' * width, '|')
#     print(f'| {"0" * width} |')
#
# print('-' * (width + 4))

# Задача 2. Локальная сеть
# У Никиты дома есть много компьютеров, которые он хочет подключить к одной локальной сети.
# Для этого ему нужно сгенерировать айпи адрес для каждого компьютера.
# Айпи адрес записывается как 4 числа, которые отделяются точкой.
# Не долго думая, для генерации Никита решил использовать арифметическую прогрессию,
# причём первые 3 числа в адресе - это члены прогрессии, а последнее число - это её сумма.
#
# Напишите программу, где пользователь вводит:
#
# Первый член прогрессии.
# Разность (шаг, с которым будут увеличиваться числа).
# И в результате получает IP-адрес.

# number = int(input('Введите число: '))
# step = int(input('Введите шаг: '))
# summ = 0
#
# print('IP-адрес: ', end = ' ')
# for i in range(3):
#     print(number, end = '.')
#     summ += number
#     number += step
#
# print(summ)


# Задача 3. Табло
# Петя пишет компьютерную спортивную игру, где каждый “гол” это десять очков.
# Он хочет сделать красивое табло с градацией этих очков.
#
# Пользователь вводит число N (N >= 0).
# Реализуйте программу, которая выводит в одну строчку каждое десятое число,
# разделяя их символами “-=-”. Эти же символы стоят перед первым числом и после последнего.
#
# Пример:
# # Введите число: 50
# # -=- 0 -=- 10 -=- 20 -=- 30 -=- 40 -=- 50 -=-

# user_number = int(input('Введите число: '))
#
# print('-=-', end = '')
# for i in range(0, user_number + 1, 10):
#     print(f' {i} ' , end = '-=-')