print('Задача 3. Театр')

# В городе планируют построить театр под открытым небом,
# но для начала нужно оценить, сколько сделать рядов, сидений в них и каким должно быть расстояние
# между рядами.

# Что нужно сделать

# Напишите программу, которая получает на вход количество рядов,
# сидений и свободных метров между рядами, а затем выводит примерный макет театра на экран.


# Сцена
# Введите кол-во рядов: 5
# Введите кол-во сидений ряду: 7
# Введите кол-во метров между рядами: 3
#
# ======= *** =======
# ======= *** =======
# ======= *** =======
# ======= *** =======
# ======= *** =======

rows_number = int(input('Кол-во рядов: '))
seats_number = int(input('Кол-во сидений: '))
distance_btw_rows = int(input('Кол-во метров между рядами: '))

for _ in range(rows_number):
    print('=' * seats_number, '*' * distance_btw_rows, '=' * seats_number)

