print('Задача 1. Я стал новым пиратом!')

# Старому капитану нужно пополнить команду,
# но на корабль попадут только достойные! Он отобрал десять человек.
# Те, кто крикнет слово «Карамба», попадут на борт.

# Что нужно сделать

# Пользователь вводит десять слов. Напишите программу, которая определяет,
# сколько из них совпадают со словом «Карамба».

secret_word = 'Карамба'
new_pirates = 0

for pirate in range(10):
    pirate_word = input('Ваше приветствие: ')
    if pirate_word == secret_word:
        print('Вы приняты на борт!')
        new_pirates += 1

print(f'Всего на борт принято {new_pirates} новых пиратов')