print('Задача 8. Древний палиндром')

# Контекст:
# Вы молодой археолог, который исследует древний свиток с таинственным посланием.
# Согласно легенде, если вы сможете прочитать палиндром из этого послания, то раскроете его секреты.
# Однако свиток весьма постарел, и некоторые буквы стерлись.
# Вам нужно разработать программу, которая поможет определить,
# является ли фрагмент послания, введенный пользователем, палиндромом.
# Если ваша программа сможет справиться с заданием, то вы сможете приблизиться к разгадке древней тайны.
#
# Задача:
# Напишите программу, которая поможет определить, является ли введенная строка палиндромом.
# Если введенная строка является палиндромом, выведите сообщение "Да, это палиндром!".
# В противном случае выведите сообщение "Нет, это не палиндром!".
#
# Советы:
# -- Для выполнения задачи используйте цикл for и итерацию по символам строки.
# -- Возможно вам понадобиться развернуть строку, чтобы это сделать вам достаточно уметь проходить
# по строке циклом и использовать конкатенацию.
# Чтобы сложить символы строки в обратном порядке - подумайте над переменой мест слагаемых.
# Будут ли результаты одинаковы если мы все символы будем добавлять в конец строки (строка = строка + символ)
# и если мы будем их добавлять в начало строки (строка = символ + строка)?

user_text = input('Введите загадочный текст: ')
reverse_text = ''

for symbol in user_text:
    reverse_text = symbol + reverse_text

if reverse_text == user_text:
    print('Да, это палиндром')
else:
    print('Нет, это не палиндром')


# Locked solutions
# 1. Мы можем проводить посимвольное сравнение строк до первого несовпадения
reverse_text = ''
for s in user_text:
    reverse_text = s + reverse_text

is_palindrome = True

# NOTE: Можно смотреть не все символы, а лишь половину, потому что
#       вторая половина идентична
for i in range(0, len(user_text)): # Здесь можно использовать len // 2 -> в два раза быстрее
    if user_text[i] != reverse_text[i]:
        is_palindrome = False
        break
print("Да, это палиндром" if is_palindrome else "Нет, это не палиндром")

# 2. Использовать два счетчика для "пробега" по одной строке
left_counter = 0
right_counter = len(user_text) - 1
is_palindrome = True
while left_counter < right_counter:
    if user_text[left_counter] != user_text[right_counter]:
        is_palindrome = False
        break
    left_counter += 1
    right_counter -= 1
print("Да, это палиндром" if is_palindrome else "Нет, это не палиндром")

# 3. Использование одной переменной для счетчика

counter = 0
is_palindrome = True
for counter in range(0, len(user_text) // 2):
    if user_text[counter] != user_text[len(user_text) - 1 - counter]:
        is_palindrome = False
        break
print("Да, это палиндром" if is_palindrome else "Нет, это не палиндром")


# 4. Использование отрицательной индексации

counter = 0
is_palindrome = True
for counter in range(0, len(user_text) // 2):
    if user_text[counter] != user_text[-counter - 1]:
        is_palindrome = False
        break
print("Да, это палиндром" if is_palindrome else "Нет, это не палиндром")

