"""
Задание 1. Гласные буквы
Команде лингвистов понравилось качество ваших программ, поэтому они решили заказать функцию
для анализатора текста, которая создавала бы список гласных букв в нём и считала бы их количество.
Напишите программу, которая запрашивает у пользователя текст и генерирует список гласных букв этого
материала (сама строка вводится на русском языке). Выведите в консоль сам список и его длину.
Пример:
Введите текст: Нужно отнести кольцо в Мордор!
Список гласных букв: ['у', 'о', 'о', 'е', 'и', 'о', 'о', 'о', 'о']
Длина списка: 9
"""

vowels_alphabet = ['а', 'е', 'ё', 'и', 'о', 'у', 'ы', 'э', 'ю', 'я']
user_message = input('Введите текст: ')
vowels_letters = [letter for letter in user_message if letter in vowels_alphabet]
print(f'Список главных букв: {vowels_letters}')
print(f'Всего классных букв: {len(vowels_letters)}')
