print('Задача 6. Новоселье')

# Семья из трёх человек устала тесниться в однушке и наконец решила переехать.
# При обсуждении,
# какую же всё-таки купить квартиру исходя из своих предпочтений и семейного бюджета,
# они остановились на нескольких вариантах:

# Первый вариант
# они готовы взять квартиру попросторнее (не менее 100 квадратных метров),
# но стоимостью не более 10 млн.

# Второй вариант — немного расширить круг поиска,
# то есть взять квартиру поменьше (от 80 квадратный метров),
# но и стоимостью не более 7 млн.

# Напишите программу,
# которая получает на вход стоимость квартиры и её площадь
# и выводит сообщение о том, подходит она или нет

apartment_price = int(input('Enter apartment price: '))
apartment_area = int(input('Enter apartment area: '))

if apartment_price <= 10 and apartment_area >= 100:
    print('Apartment satisfy')
elif apartment_price <= 7 and apartment_area >=80:
    print('Apartment satisfy')
else:
    print('Apartment is not satisfy')
