# for meters in 100,90,95,87,102:
#     if meters % 3 == 0:
#         print(meters, 'Подходит')
#     else:
#         print(meters, 'Не подходит')

# for degree in 3, 7, 5, 6, 4:
#     print(degree**2, degree**3, degree**4)

# winners = 0
# for tickets in 345, 19, 87, 1020, 421:
#     if tickets % 5==0 and tickets // 1000 < 1:
#         print(f'Счастливый билет {tickets}')
#         winners +=1
#
# print(f'Количество победителей {winners}')

# for numbers in range(11):
#     print(numbers**2)

# hours = int(input('Который час? '))
#

# Задача 2. Кукушка
# Напишите программу, которая имитировала бы часы с кукушкой.
# В начале работы она спрашивает, который час, а затем нужное количество раз пишет “Ку-ку!”.

# for kuku in range(hours):
#     print('Ky-Ky!')


# Задача 3. Любовь с первой цифры (цикл for)
# Перепишите программу из прошлого модуля, используя цикл for.
#
# Паша очень любит математику. Настолько сильно, что у него по всей комнате висят всякие таблицы умножения,
# сложения, какие-то графики, формулы. И теперь он захотел распечатать таблицу степеней двойки,
# у них как раз началась новая тема по информатике.
#
# Используя цикл for, выведите на экран для числа 2 его степени от 0 до 20.

# for numbers in range(21):
#     print(2**numbers)

# for numbers in range(1, 11):
#     print(numbers**3)


# Задача 2. Сумма чисел
# Напишите программу, где пользователь вводит любые два целых положительных числа.
# А программа суммирует все числа в диапазоне от первого до второго.
# Гарантируется, что первое введённое число всегда меньше второго.

# number_1 = int(input('Введите первое число: '))
# number_2 = int(input('Введите второе число: '))
# sum=0
#
# for numbers in range(number_1, number_2+1):
#     sum +=numbers
# print(sum)

wake_up = int(input('Во сколько проснулся: '))
calories = 0
amount_hour = 0

for hour in range(wake_up, 23):
    print(f'Сейчас {hour} часов')
    calories += int(input('Сколько калорий съел: '))
    if calories > 2000:
        print('Переел, надо спать')
        break
    amount_hour +=1

print(f'Всего съел {calories} калорий за {amount_hour} часов')
