print('Task 7. Missing card')

# Для настольной игры используются карточки с номерами от 1 до N.
# Одна карточка потерялась.
# Найдите ее, зная номера оставшихся карточек.
#
# Вводится число N,
# далее еще N − 1 чисел:
# номера оставшихся карточек (различные числа от 1 до N).
# Программа должна вывести номер потерянной карточки.

# Пример:
# Введите количество карточек: 5
# Введите номер оставшейся карточки: 1
# Введите номер оставшейся карточки: 4
# Введите номер оставшейся карточки: 5
# Введите номер оставшейся карточки: 3

# Номер пропавшей карточки: 2

amount_cards = int(input('Введите количество карточек: '))
total_sum = 0

for card in range(1, amount_cards+1):
    total_sum += card

for card in range(1, amount_cards):
    user_card = int(input('Введите номер оставшейся карточки: '))
    total_sum -= user_card

print(f'Номер оставшейся карточки {total_sum}')
