print('Задача 1. Должники')

# В базе банка хранятся данные и должников, и законопослушных граждан.
# Каждому человеку система присваивает свой номер. У нас есть случайная выборка из десяти номеров.
# Правда, иногда база глючит и выдаёт номер с отрицательным значением.
# А ещё по статистике, которую собрал наш «МирПрогБанк», каждый второй пользователь брал кредит
# и не выплатил его вовремя, то есть является должником.


# Напишите программу, которая при вводе десяти чисел определяет,
# сколько из них являются одновременно чётными и положительными.

even_and_positive_counter = 0

for i in range(0, 10):
    number = int(input(f'Введите {i + 1} число: '))
    if number % 2 == 0 and number > 0:
        even_and_positive_counter += 1

print(f'Количество должников: {even_and_positive_counter}')


