"""
Задание 4. Вечеринка
В честь своего дня рождения Артём решил закатить вечеринку у себя на даче.
Он не стал рассылать приглашения, а просто сообщил всем: «Если хотите — приходите и своих друзей
тоже зовите». Во время вечеринки люди приходили и уходили, ночевать остались не все.
К тому же на даче помещается всего шесть человек.
Дан изначальный список гостей — имена тех, кто пришёл к началу:
guests = [‘Петя’, ‘Ваня’, ‘Саша’, ‘Лиза’, ‘Катя’]
Напишите программу, которая спрашивает у пользователя, ушёл ли человек и пришёл ли новый гость,
и, исходя из ответа, добавляет в список или удаляет из него нужное имя.
При этом гостей может быть не больше шести.
Имена запрашиваются до тех пор, пока пользователь не введёт сообщение «Пора спать».

Пример:
> Сейчас на вечеринке 5 человек: [‘Петя’, ‘Ваня’, ‘Саша’, ‘Лиза’, ‘Катя’]
> Гость пришёл или ушёл? пришёл
> Имя гостя: Алекс
> Привет, Алекс!

> Сейчас на вечеринке 6 человек: [‘Петя’, ‘Ваня’, ‘Саша’, ‘Лиза’, ‘Катя’, ‘Алекс’]
> Гость пришёл или ушёл? пришёл
> Имя гостя: Гоша
> Прости, Гоша, но мест нет.

> Сейчас на вечеринке 6 человек: [‘Петя’, ‘Ваня’, ‘Саша’, ‘Лиза’, ‘Катя’, ‘Алекс’]
> Гость пришёл или ушёл? ушёл
> Имя гостя: Ваня
> Пока, Ваня!

> Сейчас на вечеринке 5 человек: [‘Петя’, ‘Саша’, ‘Лиза’, ‘Катя’, ‘Алекс’]
> Гость пришёл или ушёл? Пора спать
> Вечеринка закончилась, все легли спать.
"""

guests = ['Петя', 'Ваня', 'Саша', 'Лиза', 'Катя']
allowed_invitations = ['came', 'left', 'time for bed']

while True:
    print(f'\nNow on the party: {guests}')

    invitation = input('Guest came or left? ')
    if invitation not in allowed_invitations:
        print(f'Enter one of the commands {allowed_invitations}')
        continue

    if invitation == 'came':
        name = input('Guest name: ')
        if len(guests) >= 6:
            print(f'Sorry, {name}, there is no room for you')
            continue

        guests.append(name)
        print(f'Hi, {name}')
    elif invitation == 'left':
        name = input('Guest name: ')
        guests.remove(name)
        print(f'Bye, {name}')
    else:
        print('Party is over. Everyone went to bed')
        break
