"""
Задание 7. Считалка
N человек, пронумерованных числами от 1 до N, стоят в кругу.
Они начинают играть в считалку на выбывание.
Каждый K-й по счёту человек выходит из круга, после чего счёт продолжается со следующего
за ним человека.
На вход подаётся количество человек N и номер K.
Напишите программу, которая выводит число от 1 до N — это номер человека,
который останется в кругу последним.

Пример:
> Количество человек: 5
> Какое число в считалке? 7
> Значит, выбывает каждый 7-й человек

> Текущий круг людей: [1, 2, 3, 4, 5]
> Начало счёта с номера 1
> Выбывает человек под номером 2

> Текущий круг людей: [1, 3, 4, 5]
> Начало счёта с номера 3
> Выбывает человек под номером 5

> Текущий круг людей: [1, 3, 4]
> Начало счёта с номера 1
> Выбывает человек под номером 1

> Текущий круг людей: [3, 4]
> Начало счёта с номера 3
> Выбывает человек под номером 3

> Остался человек под номером 4

Советы и рекомендации
Чтобы индекс не вышел за пределы списка, нужно ограничить его рост.
Для этого подходит операция %: (индекс + число) % длина списка.
Так индекс не будет равен длине списка или не превысит её, а значит не выйдет за пределы списка.
"""
people_amount = int(input('How many people: '))
people = list(range(1, people_amount + 1))
game_number = int(input('What number for count in game: '))
print(f'It means each {game_number} will have to leave.')

start_count = 0
out_person = 0
for i in range(people_amount - 1):
    print(f'\nCurrent circle of people: {people}')
    print(f'Start to count from {people[start_count]}')
    out_person = (start_count + game_number - 1) % len(people)
    print(f'Person number {people[out_person % len(people)]} is eliminated')
    people.remove(people[out_person])

    start_count = out_person % len(people)

print(f'The person left is number {people[0]}')

