"""
Задача 2. Универсальная программа
Напишите функцию, возвращающую список элементов итерируемого объекта
(кортежа, строки, списка, словаря), у которых индекс — это простое число.

Для проверки на простое число напишите отдельную функцию is_prime.
Необязательное усложнение: сделайте так, чтобы основная функция состояла
только из оператора return и так же возвращала список.

Пример вызова функции:
> print(crypto([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]))
> Ответ в консоли: [2, 3, 5, 7]

Пример вызова функции:
> print(crypto('О Дивный Новый мир!'))
> Ответ в консоли: ['Д', 'и', 'н', 'й', 'в', 'й', 'р']

Советы и рекомендации
Для нумерации элементов используйте функцию enumerate.
Это позволит работать одинаково со всеми структурами данных.
"""


def is_prime_number(n: int) -> bool:
    from math import sqrt, floor
    if n < 2:
        return False
    for i in range(2, floor(sqrt(n)) + 1):
        if n % i == 0:
            return False
    return True


def get_prime_index_elems(seq: list) -> list:
    return [elem for index, elem in enumerate(seq) if is_prime_number(index)]


print(get_prime_index_elems([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]))
print(get_prime_index_elems('О Дивный Новый мир!'))
